sysbench/yusp/shirly/single_range.log
sysbench 1.0.9 (using system LuaJIT 2.0.4)

Running the test with following options:
Number of threads: 512
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 512 tps: 3036.34 qps: 18346.28 (r/w/o: 12226.52/0.00/6119.76) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 512 tps: 3065.22 qps: 18384.51 (r/w/o: 12255.87/0.00/6128.64) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 512 tps: 3048.33 qps: 18320.38 (r/w/o: 12221.12/0.00/6099.26) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 512 tps: 3067.85 qps: 18383.01 (r/w/o: 12248.91/0.00/6134.11) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 512 tps: 3062.93 qps: 18375.99 (r/w/o: 12250.83/0.00/6125.16) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 512 tps: 3057.44 qps: 18354.66 (r/w/o: 12238.98/0.00/6115.69) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 512 tps: 3063.82 qps: 18383.34 (r/w/o: 12255.80/0.00/6127.55) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 512 tps: 3064.25 qps: 18378.40 (r/w/o: 12250.50/0.00/6127.90) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 512 tps: 3060.17 qps: 18368.99 (r/w/o: 12245.86/0.00/6123.13) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 512 tps: 3061.44 qps: 18373.44 (r/w/o: 12251.96/0.00/6121.48) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 512 tps: 3069.23 qps: 18391.10 (r/w/o: 12256.53/0.00/6134.57) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 512 tps: 3052.68 qps: 18340.29 (r/w/o: 12232.43/0.00/6107.87) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 512 tps: 3065.98 qps: 18381.97 (r/w/o: 12249.21/0.00/6132.76) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 512 tps: 3063.84 qps: 18382.32 (r/w/o: 12255.94/0.00/6126.37) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 512 tps: 3056.52 qps: 18341.34 (r/w/o: 12226.80/0.00/6114.55) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 512 tps: 3061.54 qps: 18378.66 (r/w/o: 12256.67/0.00/6121.99) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 512 tps: 3065.18 qps: 18379.06 (r/w/o: 12246.11/0.00/6132.96) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 512 tps: 3061.81 qps: 18380.25 (r/w/o: 12256.23/0.00/6124.02) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 512 tps: 3062.68 qps: 18371.49 (r/w/o: 12246.42/0.00/6125.06) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 512 tps: 3064.32 qps: 18375.61 (r/w/o: 12250.07/0.00/6125.54) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 512 tps: 3061.73 qps: 18380.40 (r/w/o: 12259.43/0.00/6120.97) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 512 tps: 3063.13 qps: 18368.38 (r/w/o: 12239.82/0.00/6128.56) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 512 tps: 3060.13 qps: 18376.06 (r/w/o: 12255.00/0.00/6121.05) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 512 tps: 3063.15 qps: 18371.10 (r/w/o: 12242.40/0.00/6128.70) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 512 tps: 3064.09 qps: 18383.06 (r/w/o: 12257.57/0.00/6125.49) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 512 tps: 3062.24 qps: 18377.86 (r/w/o: 12251.27/0.00/6126.59) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 512 tps: 3062.68 qps: 18375.05 (r/w/o: 12249.80/0.00/6125.25) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 512 tps: 3057.76 qps: 18360.76 (r/w/o: 12246.74/0.00/6114.02) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 512 tps: 3068.69 qps: 18392.82 (r/w/o: 12254.54/0.00/6138.27) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 512 tps: 3061.48 qps: 18371.80 (r/w/o: 12247.33/0.00/6124.47) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            3675548
        write:                           0
        other:                           1837774
        total:                           5513322
    transactions:                        918887 (3061.82 per sec.)
    queries:                             5513322 (18370.95 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.1091s
    total number of events:              918887

Latency (ms):
         min:                                 31.85
         avg:                                167.19
         max:                                421.22
         95th percentile:                    211.60
         sum:                            153631358.03

Threads fairness:
    events (avg/stddev):           1794.7012/299.95
    execution time (avg/stddev):   300.0612/0.03